#-*- mode: org -*-
#+STARTUP: showall

* Tasks
** Windows emacs error: gnutls.c: [1] (Emacs) GnuTLS library not found
   - [[https://emacs.stackexchange.com/questions/27202/how-do-i-install-gnutls-for-emacs-25-1-on-windows][How do I install GnuTLS for Emacs 25.1 on Windows? - Emacs Stack Exchange]]

* Disk usage
#+name: disk-usage
#+begin_src sh :results table append
  df | awk -v date="$(date +"%Y-%m-%d %r")" '/sda1/{print date "," $5 "," $3}'
#+end_src

#+RESULTS: disk-usage
|------------------------+------+----------+------------|
| Date/Time              | Use% |     Used | Comment    |
|------------------------+------+----------+------------|

* Completed Tasks
** DONE Add emacs link to create link chrome extension 
   CLOSED: [2018-03-26 Mon 08:15]
   [[chrome-extension://gcmghdmnkfdbncmnmlkkglmnnhagajbm/options.html][Options - Create Link]] -- 
   - add orgmodeLink: [[%url%][%text%].]
   - add jiraLink: [%text_md%|%url%] 
** DONE Improve Emacs init files. 
   CLOSED: [2018-03-24 Sat 15:01]
   [[https://github.com/gonsie/dotfiles/tree/master/emacs][gonsie/dotfiles]]
** DONE Org-mode learning [[https://orgmode.org/manual/index.html#SEC_Contents][The Org Manual]]
   CLOSED: [2018-04-03 Tue 13:55]
   - State "DONE"       from "WAITING"    [2018-04-03 Tue 13:55]
   - Emacs init file: [[file:~/.emacs.d/init.el][init.el]]
   - Tutorials:
     - [[https://orgmode.org/worg/org-tutorials/orgtutorial_dto.html][Org-mode tutorial]]
     - [[https://orgmode.org/worg/org-tutorials/org4beginners.html][Org mode beginning at the basics]]
   - Learn to use date+time calendar
   - Best way to archive DONE tasks? [[https://orgmode.org/manual/Archiving.html#Archiving][Archiving]]  C-c C-w (org-refile) move subtree to another subtree
   - Convert orgLink to markdownLink: [[https://www.bigeekfan.com/post/20171010_hugo_org_functions/][Emacs: Convert Org-Mode Links to Markdown Links]]
** DONE Org Mode usage
CLOSED: [2018-04-07 Sat 07:40]
  - Handling long-running "inactive" tasks (projects)... waiting for someone else to act.
  - Overdue tasks? Auto-increment the day?
  Add links [2018-04-05 Thu 16:18]
  [[http://doc.norang.ca/org-mode.html][Org Mode - Organize Your Life In Plain Text!]] (a crapload of useful information and customization's)
  [[http://cachestocaches.com/2016/9/my-workflow-org-agenda/][My Workflow with Org-Agenda]]
** DONE Fix org-config: Use environment variable to control paths
CLOSED: [2018-04-09 Mon 09:21]
-- Unified init.el, more org-config.el changes.
See [[file:~/.emacs.d/org-config.el][org-config.el]]
-- Remove transfer file from agenda file list is (system-name) is "bob-x1-carbon"
<2018-04-09 Mon>

